Autodesk.Revit.DB.FDXImportOptions.GetCustomHeaders
Gets the map of a name value pair
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions.SetCustomHeaders(System.Collections.Generic.IDictionary{System.String,System.String})
Set a map of a name value pair
customHeaders:
A map of a name value pair
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions.CreateLevels
Controls whether to create Levels from FDX or not.
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions.ExchangeId
The FDX exchange identifier.
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions.#ctor
Creates a new default set of options for ATF based import.
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions
The import options used to import FDX data exchanges via ATF.
Since:
2023.0.2